In [1]:
import pandas as pd

In [2]:
data = {}

In [3]:
data['A'] = list(range(10))
data['B'] = list(range(10, 20))
data['C'] = list(range(20, 30))

In [4]:
df = pd.DataFrame(data)

In [5]:
df.head()

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

#### How would you use .iloc to get the first row of the DataFrame?

In [6]:
df.iloc[0, :]

A     0
B    10
C    20
Name: 0, dtype: int64

#### How would you use .iloc to get the last row of the DataFrame?

In [7]:
df.iloc[-1, :]

A     9
B    19
C    29
Name: 9, dtype: int64

#### How would you use .iloc to get the first 3 rows and the first 2 columns?

In [8]:
df.iloc[0:3, 0:2]

   A   B
0  0  10
1  1  11
2  2  12

#### How would you use .iloc to get the last 2 rows and last 2 columns?

In [9]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24
5  5  15  25
6  6  16  26
7  7  17  27
8  8  18  28
9  9  19  29

In [10]:
df.iloc[-2:, -2:]

    B   C
8  18  28
9  19  29

#### How would you use .iloc to get all the rows but only the first column?

In [11]:
df.iloc[:, [0]]

   A
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

#### How would you use .iloc to get all the columns but only the third row?

In [12]:
df.iloc[2, :]

A     2
B    12
C    22
Name: 2, dtype: int64

#### How would you use .iloc to get rows from index 4 to index 6, inclusive, and only the second column?

In [13]:
df.iloc[4:7, [1]]

    B
4  14
5  15
6  16

In [14]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24
5  5  15  25
6  6  16  26
7  7  17  27
8  8  18  28
9  9  19  29

#### How would you use .iloc to get the value at the fifth row and third column?

In [15]:
df.iloc[4, 2]

24

#### How would you use .iloc to get all rows for columns at index 0 and index 2?

In [16]:
df.iloc[:, 0:2]

   A   B
0  0  10
1  1  11
2  2  12
3  3  13
4  4  14
5  5  15
6  6  16
7  7  17
8  8  18
9  9  19

In [17]:
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24
5  5  15  25
6  6  16  26
7  7  17  27
8  8  18  28
9  9  19  29

#### How would you use .iloc to update the value at the first row and first column to 99?

In [18]:
df.iloc[0, 0] = 99

In [19]:
df.head()

    A   B   C
0  99  10  20
1   1  11  21
2   2  12  22
3   3  13  23
4   4  14  24

In [20]:
df

    A   B   C
0  99  10  20
1   1  11  21
2   2  12  22
3   3  13  23
4   4  14  24
5   5  15  25
6   6  16  26
7   7  17  27
8   8  18  28
9   9  19  29

#### How would you use .iloc to set all values in the last column to 0?

In [21]:
df.iloc[:, -1] = 0

In [22]:
df

    A   B  C
0  99  10  0
1   1  11  0
2   2  12  0
3   3  13  0
4   4  14  0
5   5  15  0
6   6  16  0
7   7  17  0
8   8  18  0
9   9  19  0

#### How would you use .iloc to swap the first and last rows?

In [23]:
df.iloc[0, :], df.iloc[-1, :] = df.iloc[-1, :].copy(), df.iloc[0, :].copy()

In [24]:
df

    A   B  C
0   9  19  0
1   1  11  0
2   2  12  0
3   3  13  0
4   4  14  0
5   5  15  0
6   6  16  0
7   7  17  0
8   8  18  0
9  99  10  0

#### How would you use .iloc to reverse the order of rows?

In [25]:
l = len(df)

In [26]:
df

    A   B  C
0   9  19  0
1   1  11  0
2   2  12  0
3   3  13  0
4   4  14  0
5   5  15  0
6   6  16  0
7   7  17  0
8   8  18  0
9  99  10  0

In [27]:
for i, j in zip(range(l-1, 0, -1), range(0, l)):
    if i > j:
        df.iloc[l-i-1, :], df.iloc[l-j-1, :] = df.iloc[l-j-1, :].copy(), df.iloc[l-i-1, :].copy()

In [28]:
df

    A   B  C
0  99  10  0
1   8  18  0
2   7  17  0
3   6  16  0
4   5  15  0
5   4  14  0
6   3  13  0
7   2  12  0
8   1  11  0
9   9  19  0

#### How would you use .iloc to get rows where the index is even and only the first column?

In [29]:
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [30]:
df.iloc[[x for x in list(df.index) if x%2==0], [0]]

    A
0  99
2   7
4   5
6   3
8   1

#### How would you use .iloc to get rows from index 2 to index 8 but only for columns at index 1 and index 2?

In [31]:
df.iloc[2:8, [1,2]]

    B  C
2  17  0
3  16  0
4  15  0
5  14  0
6  13  0
7  12  0